import pytest
import pandas as pd
import os

@pytest.fixture
def excel_file():
    """"""
    df = pd.DataFrame({
        'Описание': [
            'МТС оплата',
            'Покупка хлеба',
            'Билайн',
            'Продукты в магните',
            'Такси до работы',
            'Мегафон интернет',
            'Ужин в ресторане',
            'Проезд в метро'
        ],
        'Категория': [
            'Связь',
            'Еда',
            'Связь',
            'Еда',
            'Транспорт',
            'Связь',
            'Еда',
            'Транспорт'
        ],
        'Сумма': [300, 150, 500, 800, 400, 600, 1200, 100],
        'Дата операции': [
            '01.01.2024 10:00:00',
            '02.01.2024 11:00:00',
            '03.03.2024 12:00:00',
            '05.01.2024 13:00:00',
            '10.01.2024 14:00:00',
            '15.02.2024 15:00:00',
            '20.03.2024 16:00:00',
            '25.01.2024 17:00:00'
        ],
    })

    file = 'test_transactions.xlsx'
    df.to_excel(file, index=False)

    yield file

    if os.path.exists(file):
        os.remove(file)

